<?php
class Regex{
        //ネット系
        const URL   = '/^(https?|ftp)(:\/\/[-_.!~*\'()a-zA-Z0-9;\/?:\@&=+\$,%#]+)$/';
        const EMAIL = '/^([a-zA-Z0-9\.\_\-\/]+)@([a-zA-Z0-9\._\-]+)\.([a-zA-Z]+)$/';
        const IP4   = '/^(\d|[01]?\d\d|2[0-4]\d|25[0-5])\.(\d|[01]?\d\d|2[0-4]\d|25[0-5])\.(\d|[01]?\d\d|2[0-4]\d|25[0-5])\.(\d|[01]?\d\d|2[0-4]\d|25[0-5])$/';

        //ジオ的なもの
        const POST  = '/^[0-9]{3}-?[0-9]{4}$/'; //7桁郵便番号 000-0000
        const POST7 = '/^[0-9]{7}$/';//7桁郵便番号 0000000

        //電話
        const TEL = '/^[0-9]{2,4}-[0-9]{2,4}-[0-9]{4}$/';//0123-12-1234, 03-12-1234, 090-1234-1234

        //Mobile(-無し)
        const MOBILE = '/^[0-9]{3}[0-9]{3,4}[0-9]{4}$/';//09012341234
        //Mobile(-有り)
        const MOBILE2 = '/^[0-9]{3}-?[0-9]{4}-?[0-9]{4}$/';//090-1234-1234

        //数値・文字列
        const NUM   = '/^([0-9]+)$/';//数字のみ、1つ以上
        const ALPHA = '/^([a-zA-Z]+)$/';//アルファベットのみ、1つ以上
        const ALNUM = '/^([a-zA-Z0-9]+)$/';//数字かアルファベットのみ、1つ以上

        //空白
        const BLANK     = '/^\s*$/';//ホワイトキャラはOK
        const BLANK_ABS = '/^$/';//ホワイトキャラも何も含まない(       絶対的空白)

        //空行
        const BLANK_LINE = '/^\r?\n/';

        //DATE(yyyy/MM/dd)
        const DATE_FORMAT = '/^\d{4}\/\d{2}\/\d{2}$/';//1980/12/01

        //男女
        const MAN_WOMAN = '/^[1-2]{1}$/';//1 or 2
}
